//fbr

#include "cbase.h"

#if defined( INCLUDE_SCALEFORM )

#include "ienginevgui.h"
#include "buymenu_scaleform.h"
#include "gameui_util.h"
#include "inputsystem/iinputsystem.h"
#include "../gameui/cstrike15/cstrike15basepanel.h"

#include <keyvalues.h>

#include <vgui_controls/EditablePanel.h>

#include "HUD/sfhudinfopanel.h"

#include "c_cs_player.h"
#include "cs_ammodef.h"

// memdbgon must be the last include file in a .cpp file!!!
#include "tier0/memdbgon.h"

SFUI_BEGIN_GAME_API_DEF
	SFUI_DECL_METHOD( OnCancel ),
	SFUI_DECL_METHOD( InitWeapon ),
	SFUI_DECL_METHOD( GetWeaponPriceScript ),
	SFUI_DECL_METHOD( GetWeaponPriceFromIDScript ),
	SFUI_DECL_METHOD( GetPlayerLoadout ),
	SFUI_DECL_METHOD( GetPlayerBuyMenuLoadout ),
	SFUI_DECL_METHOD( AreWeaponsFree ),
SFUI_END_GAME_API_DEF( CCSBuyMenuScaleform, BuyMenu );

static BuyMenuWeaponSlot s_defaultLoadoutWeapons[2][4] =
{
	{
		{ 1, 0 },
		{ 2, 0 },
		{ 3, 0 },
		{ 4, 0 }
	},

	{
		{ 5, 0 },
		{ 6, 0 },
		{ 7, 0 },
		{ 8, 0 }
	}
};

BuyMenuWeaponData g_LoadoutArray[2][4];

void InitBuyMenuLoadoutData()
{
	Msg("Init BuyMenu Loadout Data");
	for (int team = 0; team < 2; ++team)
	{
		for (int i = 0; i < 4; ++i)
		{
			BuyMenuWeaponData& data = g_LoadoutArray[team][i];

			data.m_iWeaponDefIndex = s_defaultLoadoutWeapons[team][i].m_iWeaponDefIndex;

			data.m_iSlot = s_defaultLoadoutWeapons[team][i].m_iSlot;

			data.m_iTeam = 0;
			data.m_iPrice = 0;

			data.m_szWeaponName[0] = '\0';

			data.m_Unknown1 = 0x2C;

	if (m_bRegisteredEvents)
	{
		if (gameeventmanager)
		{
			gameeventmanager->RemoveListener(this);
		}

		m_bRegisteredEvents = false;
	}

	// Base class destruction begins
	m_iSplitScreenSlot = 13;

	// Release Scaleform movie if loaded
	if (m_bIsLoaded)
	{
		//m_pScaleformUI->RemoveElement(m_iFlashHandle, m_FlashAPI);
	}
}

void CCSBuyMenuScaleform::SetPlayerIsCT( const bool isCT )
{
	SF_FORCE_SPLITSCREEN_PLAYER_GUARD( m_iSplitScreenSlot );

	if ( FlashAPIIsValid() )
	{
		SFVALUE value = m_pScaleformUI->CreateValue( 0 );

		m_pScaleformUI->Value_SetValue( value, isCT );
		m_pScaleformUI->Value_InvokeWithoutReturn( m_FlashAPI, "setPlayerIsCT", value, 1 );
		m_pScaleformUI->ReleaseValue( value );
	}
}

void CCSBuyMenuScaleform::FlashReady()
{
	SF_FORCE_SPLITSCREEN_PLAYER_GUARD( m_iSplitScreenSlot );

	C_CSPlayer *LocalCSPlayer = C_CSPlayer::GetLocalCSPlayer();

	if ( LocalCSPlayer )
	{
		SetPlayerIsCT(LocalCSPlayer->GetTeamNumber() == 3);
	}

	CalculateBestStats();

	ListenForGameEvent( "cs_game_disconnected" );
	ListenForGameEvent( "player_team" );
	ListenForGameEvent( "player_death" );
	ListenForGameEvent( "item_equip" );

	m_bLoading = false;

	if ( m_bVisible )
	{
		Show();
	}
	else
	{
		Hide();
	}
}

void CCSBuyMenuScaleform::Show()
{
	// Register for radial input
	g_pInputSystem->SetSteamControllerMode( "RadialControls", this );

	// If the movie hasn't been loaded yet, start loading it.
	if ( m_bLoading )
	{
		if ( !FlashAPIIsValid() )
		{
			m_bLoading = true;
			SFUI_REQUEST_ELEMENT( SF_SS_SLOT( m_iSplitScreenSlot ), g_pScaleformUI, CCSBuyMenuScaleform, this, BuyMenu );
		}

		m_bVisible = true;
		return;
	}

	SF_FORCE_SPLITSCREEN_PLAYER_GUARD( m_iSplitScreenSlot );

	m_bNeedUpdate = false;
	m_iSelectedCategory = 0;
	m_iCurrentRadialSelection = 0;

	UpdatePlayerCash( true );
	UpdateTimeLeft( true );

#if defined( CEG_ALLOW_BUYMENU )
	if (true)
#endif
	{
		g_pScaleformUI->Value_InvokeWithoutReturn( m_FlashAPI, "showPanel", 0, NULL );

		m_iWheelSelection = -1;

		GetHud().DisableHud();

		C_CSPlayer *pPlayer = C_CSPlayer::GetLocalCSPlayer();
		if ( pPlayer )
			pPlayer->SetBuyMenuOpen( true );

		bool bHostageMap = false;
		if ( CSGameRules() )
			bHostageMap = CSGameRules()->IsHostageRescueMap();

		SetHostageMatch( bHostageMap );

		m_bVisible = true;
	}
}

void CCSBuyMenuScaleform::Hide()
{
	// Unregister radial controls
	g_pInputSystem->SetSteamControllerMode( NULL, this );

	if ( !m_bLoading && FlashAPIIsValid() && m_bVisible )
	{
		SF_FORCE_SPLITSCREEN_PLAYER_GUARD( m_iSplitScreenSlot );

		g_pScaleformUI->Value_InvokeWithoutReturn( m_FlashAPI, "hidePanel", nullptr, 0 );

		GetHud().EnableHud();
	}

	m_bVisible = false;

	// Clear selected weapon model
	//if ( m_pWeaponModelPanel )
		//m_pWeaponModelPanel->SetWeapon( nullptr );

	{
		SF_FORCE_SPLITSCREEN_PLAYER_GUARD( m_iSplitScreenSlot );

		C_CSPlayer *pPlayer = C_CSPlayer::GetLocalCSPlayer();
		if ( pPlayer )
			pPlayer->SetBuyMenuOpen( false );
	}
}

void CCSBuyMenuScaleform::FlashLoaded( void )
{

}

struct WeaponStatRange
{
	float maxDamage;      // +0x00
	float minDamage;      // +0x04

	float maxROF;         // +0x08
	float minROF;         // +0x0C

	float maxAccuracy;    // +0x10
	float minAccuracy;    // +0x14

	float maxMobility;    // +0x18
	float minMobility;    // +0x1C
};


void CCSBuyMenuScaleform::CalculateBestStats()
{
	WeaponStatRange *pSecondaryStats = reinterpret_cast<WeaponStatRange*>(reinterpret_cast<char*>(this) + 0x264);
	WeaponStatRange *pPrimaryStats = reinterpret_cast<WeaponStatRange*>(reinterpret_cast<char*>(this) + 0x284);

	for (int i = 1; i < WEAPON_MAX; ++i)
	{
		// Assembly skips weapon id 31
		if (i == 31)
			continue;

		const CCSWeaponInfo *pInfo = GetWeaponInfo((CSWeaponID)i);
		if (!pInfo)
			continue;

		if (!IsGunWeapon((CSWeaponType)pInfo->GetWeaponType(nullptr)))
		{
			continue;
		}

		bool bKnife = pInfo->GetWeaponType(nullptr) == WEAPONTYPE_KNIFE;

		WeaponStatRange *pStats = IsPrimaryWeapon((CSWeaponID)i) ? pPrimaryStats : pSecondaryStats;

		float damage = (float)pInfo->GetDamage(nullptr, 0, 1.0f);
		float armorDamage = pInfo->GetArmorRatio(nullptr, 0, 1.0f) * damage;

		pStats->maxDamage = MAX(pStats->maxDamage, armorDamage);
		pStats->minDamage = MIN(pStats->minDamage, armorDamage);

